Config/Catalogs/ВидыНалоговИПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыНалоговИПлатежей</Name>
			<Comment>Виды налогов, сборов и иных платежей в бюджет</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодГлавыБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Классификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Comment>Статус составителя платежного документа на перечисление налогов, сборов и иных обязательных платежей</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСоставителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначенияПлатежа</Name>
					<Comment>Текст назначения платежа для автоподстановки в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьНезаполненныеНулем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаможенныйПлатеж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКБК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыНалоговИПлатежей/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииСервер.УстановитьОтборСпискаИзНастроекКомпоновки(Список, Параметры);
	
	ДополнительныйОтборПоКБК();
	
	ПереключитьОтображениеНеактуальных(ЭтотОбъект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КомандыФормы);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборКБКИспользованиеПриИзменении(Элемент)
	ПереключитьОтборПоКБК(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНеактуальныеПриИзменении(Элемент)
	ПереключитьОтображениеНеактуальных(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДополнительныйОтборПоКБК()

	Если Параметры.Свойство("КБК") Тогда	
		ОтборКБК 			= Параметры.КБК;
		ОтборКодГлавыБК 	= Лев(ОтборКБК, 3);
		ОтборКлассификатор 	= Сред(ОтборКБК, 4);
	КонецЕсли;
	
	Если Параметры.Свойство("ВидИмущественногоНалога") И Не ЗначениеЗаполнено(ОтборКБК) Тогда
		ЗаполнитьОтборКБКПоВидуНалога(Параметры.ВидИмущественногоНалога);
	КонецЕсли;
	
	ОтборКБКИспользование = ЗначениеЗаполнено(ОтборКБК);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтборКБК",
		"Видимость", ОтборКБКИспользование);
		
	Если ОтборКБКИспользование Тогда
		ПереключитьОтборПоКБК(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборКБКПоВидуНалога(ВидИмущественногоНалога)
	
	Если Не ЗначениеЗаполнено(ВидИмущественногоНалога) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоШаблону 	= Истина;
	ИмяВМакете 		= ОбщегоНазначения.ИмяЗначенияПеречисления(ВидИмущественногоНалога);
	Макет 			= Справочники.ВидыНалоговИПлатежей.ПолучитьМакет("ШаблонОтбора");
	
	ОбластьИмя				= Макет.ПолучитьОбласть("Имя");
	ОбластьППП				= Макет.ПолучитьОбласть("ППП");
	ОбластьКлассификатор 	= Макет.ПолучитьОбласть("Классификатор");
	ОбластьШаблон 			= Макет.ПолучитьОбласть("Шаблон");
	
	н = 1;
	Пока Истина Цикл
		
		ТекИмя = СокрЛП(ОбластьИмя.Область(н, 1).Текст);
		Если НЕ ЗначениеЗаполнено(ТекИмя) Тогда
			Прервать;
		КонецЕсли;
		
		Если ТекИмя = ИмяВМакете Тогда
			ОтборКБК = СтрШаблон("%1%2", СокрЛП(ОбластьППП.Область(н, 1).Текст), СокрЛП(ОбластьКлассификатор.Область(н, 1).Текст));
			ОтборКодГлавыБК 	= СокрЛП(ОбластьППП.Область(н, 1).Текст);
			ОтборКлассификатор 	= СокрЛП(ОбластьШаблон.Область(н, 1).Текст);
			Прервать;
		КонецЕсли;
		
		н = н + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПереключитьОтборПоКБК(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список, "КодГлавыБК", Форма.ОтборКодГлавыБК, ВидСравненияКомпоновкиДанных.Равно, , Форма.ОтборКБКИспользование);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список, "Классификатор", Форма.ОтборКлассификатор, 
		?(Форма.ОтборПоШаблону, ВидСравненияКомпоновкиДанных.Подобно, ВидСравненияКомпоновкиДанных.Равно), ,
		Форма.ОтборКБКИспользование);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПереключитьОтображениеНеактуальных(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список, "НеАктуален", Ложь, , ,
		НЕ Форма.ПоказыватьНеактуальные);
	
КонецПроцедуры

#КонецОбласти
